In [1]:
import pandas as pd

# Dados das preferências de transporte
transporte = [
    "Carro", "Ônibus", "Bicicleta", "Carro", "Metrô", "Ônibus", 
    "Bicicleta", "Carro", "Metrô", "Bicicleta", "Carro", "Ônibus", 
    "Bicicleta", "Carro", "Metrô", "Carro", "Ônibus", "Bicicleta", 
    "Carro", "Metrô", "Ônibus", "Bicicleta", "Metrô", "Carro",
    "Bicicleta", "Carro", "Metrô", "Ônibus", "Carro", "Bicicleta",
    "Metrô", "Ônibus", "Carro", "Bicicleta", "Ônibus", "Metrô",
    "Carro", "Ônibus", "Metrô", "Bicicleta", "Carro", "Metrô",
    "Bicicleta", "Ônibus", "Carro", "Metrô", "Ônibus", "Bicicleta"
]

In [2]:
# Transformando em um DataFrame
dados = pd.DataFrame(transporte, columns=['Meio_Transporte'])

In [3]:
dados.head()

  Meio_Transporte
0           Carro
1          Ônibus
2       Bicicleta
3           Carro
4           Metrô

In [5]:
tabela_freq = (
    dados.groupby('Meio_Transporte')
    .size()
    .reset_index(name='Fi')
)
tabela_freq

  Meio_Transporte  Fi
0       Bicicleta  12
1           Carro  14
2           Metrô  11
3          Ônibus  11

In [10]:
tabela_freq['Fr'] = round(tabela_freq['Fi'] / tabela_freq['Fi'].sum(), 2)
tabela_freq

  Meio_Transporte  Fi    Fr
0       Bicicleta  12  0.25
1           Carro  14  0.29
2           Metrô  11  0.23
3          Ônibus  11  0.23

In [11]:
tabela_freq['F'] = tabela_freq['Fi'].cumsum()
tabela_freq

  Meio_Transporte  Fi    Fr   F
0       Bicicleta  12  0.25  12
1           Carro  14  0.29  26
2           Metrô  11  0.23  37
3          Ônibus  11  0.23  48

In [12]:
tabela_freq['Fri_acum'] = tabela_freq['Fr'].cumsum()
tabela_freq

  Meio_Transporte  Fi    Fr   F  Fri_acum
0       Bicicleta  12  0.25  12      0.25
1           Carro  14  0.29  26      0.54
2           Metrô  11  0.23  37      0.77
3          Ônibus  11  0.23  48      1.00